miniproject0/baseCase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 8;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 8;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    wallL
    {
        type            omegaWallFunction;
        value           uniform 1;
    }    
    
    wallR
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
     
    wallExpansion
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
    
    twoD
    {
        type            empty;
    }
}


// ************************************************************************* //
